{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "WidgetGenCodeTool Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WidgetGenCodeTool"
				}
			]
		},
		{
			"Namespace": "SModuleSelecter",
			"Children": [
				{
					"Source":
					{
						"Text": "Choose the target module for your new class"
					},
					"Translation":
					{
						"Text": "新しいクラスのターゲット・モジュールを選択する"
					},
					"Key": "ModuleComboToolTip"
				},
				{
					"Source":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Translation":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Key": "ModuleComboEntry"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "WidgetGenCodeTool",
					"Children": [
						{
							"Source":
							{
								"Text": "Execute WidgetGenCodeTool action"
							},
							"Translation":
							{
								"Text": "WidgetGenCodeToolアクションの実行"
							},
							"Key": "PluginAction_ToolTip"
						},
						{
							"Source":
							{
								"Text": "WidgetGenCodeTool"
							},
							"Translation":
							{
								"Text": "WidgetGenCodeTool"
							},
							"Key": "PluginAction"
						}
					]
				}
			]
		},
		{
			"Namespace": "WidgetGenCodeTool",
			"Children": [
				{
					"Source":
					{
						"Text": "A Classes class can be included and used inside other modules in addition to the module it resides in"
					},
					"Translation":
					{
						"Text": "Classesクラスは、そのクラスが存在するモジュールだけでなく、他のモジュールの中にもインクルードして使用することができます。"
					},
					"Key": "ClassLocation_Classes"
				},
				{
					"Source":
					{
						"Text": "A private class can only be included and used within the module it resides in"
					},
					"Translation":
					{
						"Text": "プライベート・クラスは、そのクラスが存在するモジュール内でのみインクルードして使用することができます。"
					},
					"Key": "ClassLocation_Private"
				},
				{
					"Source":
					{
						"Text": "A public class can be included and used inside other modules in addition to the module it resides in"
					},
					"Translation":
					{
						"Text": "パブリック・クラスは、それが存在するモジュールだけでなく、他のモジュールの内部でもインクルードして使用することができます。"
					},
					"Key": "ClassLocation_Public"
				},
				{
					"Source":
					{
						"Text": "Add Generated Widget Code Class"
					},
					"Translation":
					{
						"Text": "生成されたウィジェット・コード・クラスの追加"
					},
					"Key": "AddCodeWindowHeader_GenWidgetCode"
				},
				{
					"Source":
					{
						"Text": "Added new class {0}"
					},
					"Translation":
					{
						"Text": "新しいクラス{0}を追加"
					},
					"Key": "AddedClassSuccessNotification"
				},
				{
					"Source":
					{
						"Text": "Adding code to project..."
					},
					"Translation":
					{
						"Text": "プロジェクトにコードを追加..."
					},
					"Key": "AddingCodeToProject"
				},
				{
					"Source":
					{
						"Text": "Choose a source location"
					},
					"Translation":
					{
						"Text": "ソース場所の選択"
					},
					"Key": "NewClassBrowseTitle"
				},
				{
					"Source":
					{
						"Text": "Choose the target module for your new class"
					},
					"Translation":
					{
						"Text": "新しいクラスのターゲット・モジュールを選択する"
					},
					"Key": "ModuleComboToolTip"
				},
				{
					"Source":
					{
						"Text": "Class Type"
					},
					"Translation":
					{
						"Text": "Classタイプ"
					},
					"Key": "ClassTypeLabel"
				},
				{
					"Source":
					{
						"Text": "Classes"
					},
					"Translation":
					{
						"Text": "Classes"
					},
					"Key": "Classes"
				},
				{
					"Source":
					{
						"Text": "Create Class"
					},
					"Translation":
					{
						"Text": "クラスの生成"
					},
					"Key": "FinishButtonText_Native"
				},
				{
					"Source":
					{
						"Text": "Creates the code files to add your new class."
					},
					"Translation":
					{
						"Text": "新しいクラスを追加するためのコード・ファイルを作成します。"
					},
					"Key": "FinishButtonToolTip_Native"
				},
				{
					"Source":
					{
						"Text": "Enter a name for your new class. Class names may only contain alphanumeric characters, and may not contain a space."
					},
					"Translation":
					{
						"Text": "新しいクラスの名前を入力してください。クラス名には英数字のみを使用することができ、スペースを含めることはできません。"
					},
					"Key": "ClassNameDescription"
				},
				{
					"Source":
					{
						"Text": "Failed to add class '{0}'. {1}"
					},
					"Translation":
					{
						"Text": "クラス '{0}' の追加に失敗しました。{1}"
					},
					"Key": "AddCodeFailed_AddCodeFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to automatically compile the '{0}' module."
					},
					"Translation":
					{
						"Text": "'{0}'モジュールの自動コンパイルに失敗しました。"
					},
					"Key": "FailedToCompileModuleFmt"
				},
				{
					"Source":
					{
						"Text": "Failed to automatically hot reload the '{0}' module."
					},
					"Translation":
					{
						"Text": "{0}モジュールの自動ホットリロードに失敗しました。"
					},
					"Key": "FailedToHotReloadModuleFmt"
				},
				{
					"Source":
					{
						"Text": "Failed to compile newly created game module."
					},
					"Translation":
					{
						"Text": "新しく作成したゲームモジュールのコンパイルに失敗しました。"
					},
					"Key": "FailedToCompileNewGameModule"
				},
				{
					"Source":
					{
						"Text": "Failed to generate project files."
					},
					"Translation":
					{
						"Text": "プロジェクトファイルの生成に失敗しました。"
					},
					"Key": "FailedToGenerateProjectFiles"
				},
				{
					"Source":
					{
						"Text": "Failed to read template file \"{FullFileName}\""
					},
					"Translation":
					{
						"Text": "テンプレートファイルの読み込みに失敗しました。 \"{FullFileName}\""
					},
					"Key": "FailedToReadTemplateFile"
				},
				{
					"Source":
					{
						"Text": "Generate C++ code from Widget"
					},
					"Translation":
					{
						"Text": "WidgetからC++コードを生成する"
					},
					"Key": "WidgetGenCodeTooltip"
				},
				{
					"Source":
					{
						"Text": "Header File"
					},
					"Translation":
					{
						"Text": "ヘッダーファイル"
					},
					"Key": "HeaderFileLabel"
				},
				{
					"Source":
					{
						"Text": "Name"
					},
					"Translation":
					{
						"Text": "Name"
					},
					"Key": "NameLabel"
				},
				{
					"Source":
					{
						"Text": "Name Your New Class"
					},
					"Translation":
					{
						"Text": "新しいクラスに名前をつける"
					},
					"Key": "NameClassGenericTitle"
				},
				{
					"Source":
					{
						"Text": "Path"
					},
					"Translation":
					{
						"Text": "パス"
					},
					"Key": "PathLabel"
				},
				{
					"Source":
					{
						"Text": "Private"
					},
					"Translation":
					{
						"Text": "Private"
					},
					"Key": "Private"
				},
				{
					"Source":
					{
						"Text": "Project now includes sources, please close the editor and build from your IDE."
					},
					"Translation":
					{
						"Text": "プロジェクトにソースが含まれるようになりました。エディターを閉じて、IDEからビルドしてください。"
					},
					"Key": "LiveCodingNoSources"
				},
				{
					"Source":
					{
						"Text": "Public"
					},
					"Translation":
					{
						"Text": "Public"
					},
					"Key": "Public"
				},
				{
					"Source":
					{
						"Text": "Source File"
					},
					"Translation":
					{
						"Text": "ソースファイル"
					},
					"Key": "SourceFileLabel"
				},
				{
					"Source":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser."
					},
					"Translation":
					{
						"Text": "クラス '{0}' の追加に成功しましたが、'{1}' モジュールを再コンパイルしないとコンテンツ・ブラウザに表示されません。"
					},
					"Key": "AddCodeSuccessWithHotReload"
				},
				{
					"Source":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser.\n\nWould you like to edit the code now?"
					},
					"Translation":
					{
						"Text": "クラス'{0}'の追加に成功しましたが、'{1}'モジュールを再コンパイルしないとコンテンツブラウザに表示されません。"
					},
					"Key": "AddCodeSuccessWithHotReloadAndSync"
				},
				{
					"Source":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser. {2}\n\nWould you like to open the Output Log to see more details?"
					},
					"Translation":
					{
						"Text": "クラス「{0}」の追加に成功しましたが、コンテンツ・ブラウザに表示する前に「{1}」モジュールを再コンパイルする必要があります。{出力ログを開いて詳細を見ますか？"
					},
					"Key": "AddCodeFailed_HotReloadFailed"
				},
				{
					"Source":
					{
						"Text": "When you click the \"Create\" button below, a header (.h) file and a source (.cpp) file will be made using this name."
					},
					"Translation":
					{
						"Text": "下の「Create」ボタンを押すと、その名前でヘッダーファイル（.h）とソースファイル（.cpp）が作られます。"
					},
					"Key": "ClassNameDetails_Native"
				},
				{
					"Source":
					{
						"Text": "Widget Gen Code"
					},
					"Translation":
					{
						"Text": "Widget Gen Code"
					},
					"Key": "WidgetGenCode"
				},
				{
					"Source":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Translation":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Key": "ModuleComboEntry"
				}
			]
		}
	]
}